Repository: manuelvdlt99/MejorAppT
Catalog: MejorAppTG1/Resources/Localization/Strings.*.resx
Languages: es, fr

# str_MainPage_BtnQuickTest_Questions
source: 20 questions
es: 20 preguntas

# str_ResultHistoryPage_LblDate
source: Date:
es: Fecha:

# str_TestPage_QuestionCount
source: Question {0}/{1}
es: Pregunta {0}/{1}
