Repository: manuelvdlt99/MejorAppT
Catalog: MejorAppTG1/Resources/Localization/Strings.*.resx
Languages: es, fr

# str_EatingTest_Question23
source: I'm on a diet.
es: Estoy haciendo dieta.
fr: Je suis au régime.

# str_EatingTest_Question24
source: I like to have an empty stomach.
es: Me gusta tener el estómago vacío.
fr: J'aime avoir l'estomac vide.

# str_EatingTest_Question25
source: I like to try new, tasty and calorie-rich dishes.
es: Me gusta probar platos nuevos, sabrosos y ricos en calorías.
fr: J'aime essayer de nouveaux plats savoureux et riches en calories.

# str_EatingTest_Question26
source: After meals I have the urge to vomit.
es: Después de las comidas tengo el impulso de vomitar.
fr: Après les repas, j'ai envie de vomir.

# str_TestPage_BtnOption1
source: Never
es: Nunca
fr: Jamais

# str_TestPage_BtnOption2
source: Rarely
es: En pocas ocasiones
fr: Rarement

# str_TestPage_BtnOption3
source: With some frequency
es: Con cierta frecuencia
fr: Avec une certaine fréquence

# str_TestPage_BtnOption4
source: Often or almost always
es: A menudo o casi siempre
fr: Couramment ou presque toujours

# str_TestPage_BtnOption5
source: Always
es: Siempre
fr: Toujours

# str_TestPage_BtnPrevious
source: Previous
es: Anterior
fr: Précédent

# str_TestPage_BtnNext
source: Next
es: Siguiente
fr: Suivant

# str_TestPage_EmptyAnswer
source: Empty answer
es: Respuesta vacía
fr: Réponse vide

# str_TestPage_EmptyAnswer_Msg
source: Please select an option.
es: Por favor, selecciona una opción.
fr: Veuillez sélectionner une option.

# str_TestPage_BtnFinish
source: Finish
es: Finalizar
fr: Finir

# str_TestPage_LeaveTest_Warning
source: You are leaving this test. What to do with this attempt?
es: Vas a abandonar este test. ¿Qué harás con este intento?
fr: Vous allez abandonner ce test. Que ferez-vous de cette tentative ?

# str_TestPage_LeaveTest_BtnSave
source: Save
es: Guardar
fr: Enregistrer

# str_TestPage_LeaveTest_BtnDelete
source: Delete
es: Eliminar
fr: Éliminer

# str_TestPage_BtnOption2_2
source: Almost never
es: Casi nunca
fr: Presque jamais

# str_TestPage_BtnOption3_2
source: Often
es: A menudo
fr: Couramment

# str_TestPage_BtnOption4_2
source: Quite often
es: Muy a menudo
fr: Très couramment

# str_TestPage_BtnOption2_3
source: On occasion
es: En alguna ocasión
fr: À l'occasion

# str_TestPage_BtnOption4_3
source: Almost always
es: Casi siempre
fr: Presque toujours

# str_AnxietyAdvice1_Title
source: Accept uncertainty
es: Acepta la incertidumbre
fr: Acceptez l'incertitude

# str_AnxietyAdvice1_Content
source: Accept that you don't know everything and that it's perfectly fine to feel doubts during an exam. This will help you not overburden yourself.
es: Acepta que no sabes todo y que es normal sentir dudas ante un examen; esto te ayudará a no sobrecargarte.
fr: Acceptez que vous ne sachiez pas tout et qu'il est normal d'avoir des doutes avant un examen ; cela vous aidera à ne pas vous surcharger.

# str_AnxietyAdvice2_Title
source: Think positive
es: Piensa positivamente
fr: Pensez positif

# str_AnxietyAdvice2_Content
source: Try to keep a positive attitude and focus on all the things you've learned instead of worrying about what you don't know.
es: Trata de mantener una actitud positiva y enfócate en todas las cosas que has aprendido en lugar de preocuparte por lo que no sabes.
fr: Essayez de garder une attitude positive et de vous concentrer sur toutes les choses que vous avez apprises plutôt que de vous inquiéter de ce que vous ne savez pas.

# str_AnxietyAdvice3_Title
source: Identify your toxic thoughts
es: Identifica tus pensamientos tóxicos
fr: Identifiez vos pensées toxiques

# str_AnxietyAdvice3_Content
source: Identify those feelings about exams, like "I'm not going to pass", "I'm a failure", etc. This will help you change them.
es: Identifica estos pensamientos sobre los exámenes, como «No voy a aprobar», «Soy un fracaso», etc., te ayudará a cambiarlos.
fr: Identifier ces pensées sur les examens, telles que « je ne vais pas réussir », « je suis un raté », etc. vous aidera à les changer.

# str_AnxietyAdvice4_Title
source: Block and change your negative thoughts
es: Bloquea y cambia tus pensamientos negativos
fr: Bloquez et changez vos pensées négatives

# str_AnxietyAdvice4_Content
source: When facing a negative thought, say "Stop" and try to see the situation from a more objective point of view; this will help you see the reality of the situation.
es: Ante un pensamiento negativo di «Para» o «Stop» y trata de ver la situación desde una perspectiva más objetiva; esto te ayudará a ver la realidad de la situación.
fr: Lorsque vous êtes confronté à une pensée négative, dites « Stop » ou « Arrête » et essayez de voir la situation d'un point de vue plus objectif ; cela vous aidera à voir la réalité de la situation.

# str_AnxietyAdvice5_Title
source: Empower yourself
es: Empodérate
fr: Donnez-vous le pouvoir d'agir

# str_AnxietyAdvice5_Content
source: These simple body postures give instant security and confidence. https://www.youtube.com/embed/jnOfzrDZYrA
es: Estas sencillas posturas corporales dan seguridad y confianza al instante. Ver vídeo: https://www.youtube.com/embed/jnOfzrDZYrA
fr: Ces simples postures corporelles procurent une sécurité et une confiance instantanées. https://www.youtube.com/embed/jnOfzrDZYrA

# str_AnxietyAdvice6_Title
source: Accept anxiety
es: Acepta la ansiedad
fr: Acceptez l'anxiété

# str_AnxietyAdvice6_Content
source: Occasional anxiety is normal and can help us be more focused. It is not a danger to you.
es: Tener ansiedad de manera puntual es normal y nos puede ayudar a estar más concentrados. No es un peligro para ti.
fr: L'anxiété occasionnelle est normale et peut nous aider à être plus concentrés. Elle ne constitue pas un danger pour vous.

# str_AnxietyAdvice7_Title
source: Talk to yourself
es: Dialoga contigo mismo
fr: Parlez avec vous-même

# str_AnxietyAdvice7_Content
source: Slowly read this paragraph when you have an anxiety attack: "All these symptoms you are currently feeling, even if they are unpleasant, ARE NOT DANGEROUS, YOU ARE NOT GOING TO DIE, NOR ARE YOU GOING TO LOSE CONTROL OF YOUR BREATHING. This crisis you are feeling has a beginning, a peak and an end. This means that whatever you do, it will end, even if you do nothing. So avoid trying to control or fight it, that will make it worse. Instead, listen to your body and try to name whatever you are feeling right now. It is your body and the psychophysiological response it triggers when it thinks it's in danger. Therefore, these are normal reactions in my body and something terrible is not going to happen. SO REMEMBER: YOU ARE NOT IN DANGER AND IN A FEW MINUTES IT WILL PASS".
es: Lee despacio este texto cuando tengas un ataque de ansiedad: «Todos estos síntomas que estás sintiendo ahora mismo, aunque sean desagradables, NO SON PELIGROSOS, NO VAS A MORIR, NI VAS A PERDER EL CONTROL DE TU RESPIRACIÓN. Esta crisis que estás sintiendo tiene un inicio, un pico máximo y un final. Esto quiere decir que hagas lo que hagas, va a terminar, aunque tú no hagas nada. Así que evita intentar controlar o luchar contra ella, eso lo empeorará. En vez de eso, escucha a tu cuerpo e intenta ponerle nombre a todo lo que estás sintiendo ahora mismo. Es tu cuerpo y la respuesta psicofisiológica que se desencadena cuando cree que está en peligro. Por lo tanto, son reacciones normales en mi cuerpo y no va a suceder algo terrible. ASÍ QUE RECUERDA: NO ESTÁS EN PELIGRO Y EN UNOS MINUTOS PASARÁ».
fr: Lisez lentement ce texte lorsque vous avez une crise d'angoisse : « Tous ces symptômes que vous ressentez en ce moment, même s'ils sont désagréables, NE SONT PAS DANGEREUX, VOUS N'ALLIEZ PAS MOURIR, NI PERDRE LE CONTRÔLE DE VOTRE RESPIRATION. Cette crise que vous ressentez a un début, un pic et une fin. Cela signifie que, quoi que vous fassiez, elle se terminera, même si vous ne faites rien. Évitez donc d'essayer de la contrôler ou de la combattre, cela ne ferait qu'empirer les choses. Écoutez plutôt votre corps et essayez de mettre un nom sur ce que vous ressentez en ce moment. Il s'agit de votre corps et de la réponse psychophysiologique qu'il déclenche lorsqu'il pense être en danger. Il s'agit donc de réactions normales de mon corps et il ne va pas se passer quelque chose de terrible. N'OUBLIEZ PAS : VOUS N'ÊTES PAS EN DANGER ET DANS QUELQUES MINUTES, CELA PASSERA ».

# str_AnxietyAdvice8_Title
source: Change your attentional focus
es: Cambia tu foco atencional
fr: Changez votre attention

# str_AnxietyAdvice8_Content
source: Think or note down: 5 things you can see at the moment, 4 things you can touch, 3 things you can hear, 2 things you can smell, 1 thing you can taste.
es: Piensa o escribe: 5 cosas que puedas ver en este momento; 4 cosas que puedas tocar; 3 cosas que puedas escuchar; 2 cosas que puedas oler; 1 cosa que puedas saborear.
fr: Pensez ou écrivez : 5 choses que vous pouvez voir en ce moment ; 4 choses que vous pouvez toucher ; 3 choses que vous pouvez entendre ; 2 choses que vous pouvez sentir ; 1 chose que vous pouvez goûter.

# str_AnxietyAdvice9_Content
source: Create a pre-exam habit, it builds confidence and trust. For example: sit down, get your pens ready, and take three slow, deep breaths while thinking the phrase "I can do anything".
es: Crea una rutina previa al examen, da seguridad y confianza. Ejemplo: siéntate, prepara los bolígrafos, y haz tres inspiraciones lentas y profundas mientras piensas la frase «puedo con todo».
fr: Créez une routine avant l'examen, ça renforce la confiance. Par exemple : asseyez-vous, préparez vos stylos et prenez trois respirations lentes et profondes en pensant à la phrase « Je peux tout faire ».

# str_AnxietyAdvice9_Title
source: Establish a routine
es: Establece una rutina
fr: Établissez une routine

# str_AnxietyAdvice10_Title
source: Practice relaxation techniques
es: Practica técnicas de relajación
fr: Pratiquez des techniques de relaxation

# str_AnxietyAdvice10_Content
source: Practice relaxation techniques. It can help you mitigate anxiety and improve your ability to face exam situations. Would you like to learn them? Videos in Spanish: https://www.youtube.com/embed/F9R-uz9QZ58?si=HA2sN9VasJnKU8jk https://www.youtube.com/embed/ycSQVQqzk24?si=Y9TtCqZRvzbN7gUV https://www.youtube.com/embed/W5k__liBQzI?si=s2-Ukr5BBSlT6zxd https://www.youtube.com/embed/JPfg6QEszNk?si=4mq7WeC2ETNH-qzr
es: Practica técnicas de relajación. Te puede ayudar a reducir la ansiedad y mejorar la capacidad de afrontar situaciones de examen. ¿Quieres conocerlas? https://www.youtube.com/embed/F9R-uz9QZ58?si=HA2sN9VasJnKU8jk https://www.youtube.com/embed/ycSQVQqzk24?si=Y9TtCqZRvzbN7gUV https://www.youtube.com/embed/W5k__liBQzI?si=s2-Ukr5BBSlT6zxd https://www.youtube.com/embed/JPfg6QEszNk?si=4mq7WeC2ETNH-qzr
fr: Pratiquez des techniques de relaxation. Cela peut vous aider à réduire votre anxiété et à améliorer votre capacité à faire face aux situations d'examen. Voulez-vous les connaître ? Vidéos en espagnol : https://www.youtube.com/embed/F9R-uz9QZ58?si=HA2sN9VasJnKU8jk https://www.youtube.com/embed/ycSQVQqzk24?si=Y9TtCqZRvzbN7gUV https://www.youtube.com/embed/W5k__liBQzI?si=s2-Ukr5BBSlT6zxd https://www.youtube.com/embed/JPfg6QEszNk?si=4mq7WeC2ETNH-qzr

# str_AnxietyAdvice11_Title
source: Use metaphors
es: Usa metáforas
fr: Utilisez des métaphores

# str_AnxietyAdvice11_Content
source: Slowly read the following metaphor: "Imagine you're at sea, a seemingly calm place, and suddenly, a massive wave appears. As it approaches you feel afraid and you instinctively run away from it, but by getting away, the wave becomes stronger and more frightening and seemingly continues to chase you. The farther you run away from the wave, the bigger it becomes, and the farther you run away, the stronger it gets. However, if you don't avoid the wave, the crash will be strong at first, but you will eventually dry out and keep enjoying the sea. If another massive wave comes along and you still don't avoid it, the crash and the damage will undoubtedly be weaker. Oftentimes problems are exactly the same; our feelings, memories or emotions may be unpleasant to begin with, but if we run away from them, all we'll do is make them bigger and more important. However, if we do not avoid them and, on the contrary, accept them as they are, even though they may torment us a little at first, they will eventually become commonplace and less important, letting us be more flexible and permissive with ourselves."
es: Lee despacio la siguiente metáfora: «Imagina que estás en el mar, un sitio aparentemente tranquilo, y de repente, aparece una gran ola. Cuando se acerca nos da miedo y por instinto nos alejamos de ella, pero al alejarnos, la ola se vuelve más fuerte y atemorizante y aparentemente sigue persiguiéndonos. Mientras más te alejas de la ola, más grande se vuelve y terminará siendo más fuerte cuanto más te alejes. En cambio, si no evitas a la ola, el atropello será fuerte al principio, pero luego te secarás y seguirás disfrutando del mar. Si viene otra ola gigante y sigues sin evitarla, sin duda será cada vez menor el atropello y el daño. Muchas veces los problemas son exactamente igual; nuestros pensamientos, recuerdos o emociones son desagradables de inicio, pero si huimos de ellos, lo único que haremos es hacerlos más grandes y darles más importancia. Sin embargo, si no los evitamos y, al contrario, los aceptamos tal cual son, aunque al inicio nos atormenten un poco, al final se volverán cotidianos y menor importantes, permitiéndonos ser más flexibles y permisivos con nosotros mismos».
fr: Lisez lentement la métaphore suivante : « Imaginez que vous êtes dans la mer, un endroit apparemment calme, et que soudain, une grosse vague apparaît. Lorsqu'elle s'approche de vous, vous avez peur et vous vous en éloignez instinctivement, mais à mesure que vous vous éloignez, la vague devient plus forte et plus effrayante et semble continuer à vous poursuivre. Plus vous vous éloignez de la vague, plus elle grossit, et plus vous vous éloignez, plus elle devient forte. En revanche, si vous n'évitez pas la vague, le martèlement sera fort au début, mais ensuite vous vous assécherez et continuerez à profiter de la mer. Si une autre vague géante arrive et que vous ne l'évitez toujours pas, vous serez sans doute de moins en moins touché et de moins en moins endommagé. Souvent, les problèmes sont exactement les mêmes : nos pensées, nos souvenirs ou nos émotions sont désagréables au départ, mais si nous les fuyons, nous ne faisons que les rendre plus grands et plus importants. En revanche, si nous ne les évitons pas et que, au contraire, nous les acceptons tels quels, même s'ils nous tourmentent un peu au début, ils finiront par devenir quotidiens et moins importants, ce qui nous permettra d'être plus souples et plus permissifs avec nous-mêmes ».

# str_AnxietyAdvice12_Title
source: Identify, block and change
es: Identifica, bloquea y cambia
fr: Identifiez, bloquez et changez

# str_AnxietyAdvice12_Content
source: Identify toxic thoughts regarding exams, like "I'm not going to pass" or "I'm a failure". Block those thoughts, say "Stop". Try to see the situation from a more objective point of view; this will help you see the reality of the situation.
es: Identifica los pensamientos tóxicos sobre los exámenes, como «No voy a aprobar», «Soy un fracaso». Bloquea esos pensamientos, di «Para» o «Stop». Trata de ver la situación desde una perspectiva más objetiva, esto te ayudará a ver la realidad de la situación.
fr: Identifiez les pensées toxiques concernant les examens, telles que « Je ne vais pas réussir », « Je suis un raté ». Bloquez ces pensées, dites « Stop » ou « Arrête ». Essayez de voir la situation d'un point de vue plus objectif, cela vous aidera à voir la réalité de la situation.

# str_AnxietyAdvice13_Title
source: Study every day
es: Estudia todos los días
fr: Étudiez tous les jours

# str_AnxietyAdvice13_Content
source: Study more often, not longer. Space out study sessions on the same subject. Don't binge study just the day before, you run the risk of blocking yourself and going blank.
es: Estudia más veces las cosas, no más tiempo. Espacia las sesiones de estudio de un mismo tema. No te des el atracón solo el día anterior, corres el riesgo de bloquearte y quedarte en blanco.
fr: Étudiez plus souvent, pas plus longtemps. Espacez les sessions d'étude d'un même sujet. N'étudiez pas à outrance la veille, vous risqueriez de vous bloquer et d'avoir un trou de mémoire.

# str_AnxietyAdvice14_Title
source: Organise yourself
es: Organízate
fr: Vous organisez

# str_AnxietyAdvice14_Content
source: Keep your diary up to date. Prepare a study timetable and follow a plan to cover all subjects. Review your study techniques (ask your counsellor if you have any doubts). Solve all your doubts about the subject with your teacher.
es: Lleva al día tu agenda. Prepara un horario de estudio y sigue un plan para cubrir todas las materias. Revisa tus técnicas de estudio (pregunta a tu orientador/a si tienes dudas). Resuelve con tu profesor todas las dudas de la materia.
fr: Tenez votre agenda à jour. Préparez un emploi du temps et suivez un plan pour couvrir toutes les matières. Révisez vos techniques d'étude (demandez à votre conseiller si vous avez des doutes). Résolvez tous vos doutes sur la matière avec votre professeur.

# str_AnxietyAdvice15_Title
source: Watch your habits
es: Cuida tus hábitos
fr: Surveillez vos habitudes

# str_AnxietyAdvice15_Content
source: Get enough sleep, especially the day before the exam (necessary for good concentration), exercise, eat a balanced and healthy diet (avoid energy drinks and alcohol).
es: Duerme lo suficiente, sobre todo el día antes del examen (es necesario para una buena concentración); haz ejercicio físico; sigue una dieta equilibrada y saludable (evita las bebidas energizantes y el alcohol).
fr: Dormez suffisamment, surtout la veille de l'examen (c'est nécessaire pour une bonne concentration) ; faites de l'exercice ; mangez de manière équilibrée et saine (évitez les boissons énergisantes et l'alcool).

# str_AnxietyAdvice16_Title
source: Seek support
es: Busca apoyo
fr: Cherchez un soutien

# str_AnxietyAdvice16_Content
source: Talk to a friend, relative or teacher about your worries and seek their support.
es: Habla con un amigo, familiar o profesor sobre tus preocupaciones y busca su apoyo.
fr: Parlez de vos inquiétudes à un ami, à un membre de votre famille ou à un enseignant et cherchez leur soutien.

# str_AnxietyAdvice17_Title
source: Seek professional help
es: Busca ayuda profesional
fr: Cherchez l'aide d'un professionnel

# str_AnxietyAdvice17_Content
source: If you cannot control your anxiety and it is affecting your everyday life, seek professional help.
es: Si no puedes controlar tu estado de ansiedad y está afectando tu vida diaria, busca ayuda profesional.
fr: Si vous n'arrivez pas à contrôler votre anxiété et qu'elle affecte votre vie quotidienne, cherchez l'aide d'un professionnel.

# str_AnxietyAdvice18_Title
source: Practice self-observation
es: Practica la autoobservación
fr: Pratiquez l'auto-observation

# str_AnxietyAdvice18_Content
source: Pay attention and write down when you have anxiety and study why; that will help you know what your triggers are (several exams in the same week, for example) and deal with that anxiety: ● When it happened: Monday, considering that I have 3 exams. ● What I'm feeling: Anxiety, trouble breathing... ● Now see the situation from the outside (like in a third-person video game) and explain it. ● What I can do to cope with the situation: Focus on one exam and when you finish with another one...; help yourself with breathing and relaxation techniques...
es: Fíjate y apunta en qué momentos tienes ansiedad y estudia el porqué, eso te ayuda a saber cuáles son tus disparadores (varios exámenes la misma semana, por ejemplo) y anteponte a esa ansiedad: ● Cuándo ha pasado: El lunes al ver que tengo 3 exámenes. ● Qué estoy sintiendo: Ansiedad, me cuesta respirar... ● Ahora veo la situación desde fuera (como en los videojuegos de tercera persona) y la explicas ● Qué puedo hacer para afrontar la situación: enfócate en un examen y cuando termines con otro...; ayúdate de técnicas de respiración y relajación...
fr: Notez et écrivez quand vous avez de l'anxiété et étudiez pourquoi, cela vous aide à savoir quels sont vos déclencheurs (plusieurs examens dans la même semaine, par exemple) et à gérer cette anxiété : ● Quand cela s'est-il produit : lundi, quand je vois que j'ai 3 examens. ● Ce que je ressens : de l'anxiété, j'ai du mal à respirer.... ● Maintenant je vois la situation de l'extérieur (comme dans les jeux vidéo à la troisième personne) et je l'explique. ● Ce que je peux faire pour gérer la situation : me concentrer sur un examen et en finir avec un autre... ; m'aider avec des techniques de respiration et de relaxation...

# str_AnxietyAdvice19_Title
source: Make a plan that you can stick to
es: Haz un plan que puedas cumplir
fr: Faissez un plan que vous pouvez respecter

# str_AnxietyAdvice19_Content
source: If you avoid exams, going to class or studying because of your anxiety, set yourself attainable goals.
es: Si evitas exámenes o ir a clase o estudiar debido a tu ansiedad, establece metas alcanzables.
fr: Si vous évitez les examens, les cours ou les études à cause de votre anxiété, fixez-vous des objectifs réalisables.

# str_AnxietyAdvice20_Title
source: Bit by bit
es: Poco a poco
fr: Petit à petit

# str_AnxietyAdvice20_Content
source: Start simple (study at home), follow up with class attendance; go into the exam with confidence.
es: Empieza por lo más sencillo (estudiar en casa), sigue con asistencia a clase; ve con confianza al examen.
fr: Commencez simplement (étudiez à la maison), suivez les cours avec assiduité et abordez l'examen avec confiance.

# str_ResultsPage_Title
source: Advices
es: Recomendaciones
fr: Conseils

# str_ResultsPage_LblIntro_Medium
source: Your anxiety levels are within the average range. But you need to be careful and continue to monitor your symptoms to prevent the situation from getting out of hand.
es: Tus niveles de ansiedad se sitúan dentro del límite de la media. Pero tienes que tener cuidado y seguir observando la sintomatología para evitar que la situación te sobrepase.
fr: Votre niveau d'anxiété se situe dans la moyenne. Mais vous devez être prudent et continuer à surveiller vos symptômes pour éviter que la situation ne devienne incontrôlable.

# str_ResultsPage_LblIntro_High
source: Your anxiety levels are too high. It's important that you learn to manage that emotion, as these levels can give way to important emotional and health problems.
es: Tienes unos niveles de ansiedad demasiado altos. Es importante que aprendas a gestionar esa emoción, ya que estos niveles pueden dar lugar a problemas emocionales y de salud importantes.
fr: Votre niveau d'anxiété est trop élevé. Il est important que vous appreniez à gérer cette émotion, car ces niveaux peuvent entraîner des problèmes émotionnels et de santé importants.
