Repository: manuelvdlt99/MejorAppT
Catalog: MejorAppTG1/Resources/Localization/Strings.*.resx
Languages: es, fr

# str_EatingTest
source: Eating disorders
es: Trastornos de la conducta alimentaria
fr: Troubles des conduites alimentaires

# str_FullTest
source: Anxiety (complete)
es: Ansiedad (completo)
fr: Anxiété (complet)

# str_Genders_Woman
source: Female
es: Mujer
fr: Femme

# str_LoginPage_BtnLogIn
source: Select user
es: Iniciar sesión
fr: Sélectionner utilisateur

# str_LoginPage_BtnLogin_entryAgeError
source: Please enter a valid age.
es: Por favor, introduce una edad correcta.
fr: Veuillez saisir le bon âge.

# str_LoginPage_BtnLogin_entryAgeError2
source: The age must be a number between 12 and 99.
es: La edad debe ser un número entre 12 y 99.
fr: L'âge doit être un chiffre compris entre 12 et 99.

# str_LoginPage_BtnLogin_entryNameError
source: Please enter a name.
es: Por favor, introduce un nombre.
fr: Veuillez saisir un nom.

# str_LoginPage_BtnSignUp
source: Create user
es: Crear usuario
fr: Créer utilisateur

# str_LoginPage_BtnSignUp_Age
source: Age:
es: Edad:
fr: Âge :

# str_LoginPage_BtnSignUp_Gender
source: Gender
es: Género:
fr: Genre

# str_LoginPage_BtnSignUp_Name
source: Name:
es: Nombre:
fr: Nom d'utilisateur :

# str_LoginPage_Instructions
source: Please log in or create a user.
es: Por favor, inicia sesión o crea un usuario:
fr: Veuillez vous connecter ou créer un compte utilisateur :

# str_LoginPage_Motto
source: Knowing your mind, caring for your wellbeing
es: Conociendo tu mente, cuidando tu bienestar
fr: Connaître son esprit, protéger son bien-être

# str_MainPage_BtnEatingTest
source: Eating disorders
es: Trastornos de la conducta alimentaria
fr: Troubles des conduites alimentaires

# str_MainPage_BtnEatingTest_ETA
source: Estimated time: 3 minutes
es: Duración estimada: 3 minutos
fr: Durée estimée : 3 minutes

# str_MainPage_BtnFullTest
source: Anxiety (complete)
es: Ansiedad (completo)
fr: Anxiété (complet)

# str_MainPage_BtnFullTest_ETA
source: Estimated time: 6 minutes
es: Duración estimada: 6 minutos
fr: Durée estimée : 6 minutes

# str_MainPage_BtnNo
source: No
fr: Non

# str_MainPage_BtnQuickTest
source: Anxiety (quick)
es: Ansiedad (rápido)
fr: Anxiété (rapide)

# str_MainPage_BtnQuickTest_ETA
source: Estimated time: 2 minutes
es: Duración estimada: 2 minutos
fr: Durée estimée : 2 minutes

# str_MainPage_BtnYes
source: Yes
es: Sí
fr: Oui

# str_MainPage_EatingTestWarning
source: If your dietary concerns are related to wanting to gain more weight or muscle mass, this app may not be right for you at this time. We are working to address these needs in future versions. Still, are you sure you want to take the test?
es: Si tus preocupaciones con la alimentación están relacionadas con querer ganar más peso o masa muscular, es posible que esta aplicación no sea la indicada para ti en este momento. Estamos trabajando para abordar estas necesidades en futuras versiones. Aun así, ¿seguro que quieres realizar el test?
fr: Si vos préoccupations alimentaires sont liées à la volonté de prendre du poids ou de la masse musculaire, cette application n'est peut-être pas adaptée à vos besoins pour le moment. Nous nous efforçons de répondre à ces besoins dans les prochaines versions. Tout de même, êtes-vous sûr de vouloir faire le test ?

# str_MainPage_LblSelectTest
source: Find out more about you! Select a test and take the first step towards your wellbeing.
es: ¡Descubre más sobre ti! Selecciona un test y da el primer paso hacia tu bienestar.
fr: Apprenez-en plus sur vous-même ! Sélectionnez un test et faites le premier pas vers votre bien-être.

# str_MainPage_LblWelcome
source: Hey there, user!
es: ¡Hola, usuario!
fr: Bonjour, utilisateur !

# str_MainPage_LblWelcome_Dyn
source: Hey there, {0}!
es: ¡Hola, {0}!
fr: Bonjour, {0} !

# str_MainPage_UnfinishedTest
source: Unfinished test
es: Test no terminado
fr: Test inachevé

# str_MainPage_UnfinishedTest_Msg
source: You've got an unfinished test dated {0}. Would you like to continue it?
es: Tienes un test sin terminar del {0}. ¿Deseas continuarlo?
fr: Vous avez un test inachevé depuis {0}. Voulez-vous le poursuivre ?

# str_MainPage_Warning
source: Warning
es: Advertencia
fr: Alerte

# str_Genders_Man
source: Male
es: Hombre
fr: Homme

# str_QuickTest
source: Anxiety (quick)
es: Ansiedad (rápido)
fr: Anxiété (rapide)

# str_QuickTest_Question1
source: During exams, my hands get sweaty or I feel stiffness in my hands and/or arms.
es: En los exámenes me sudan las manos o siento rigidez en manos y/o brazos.
fr: Pendant les examens, j'ai les mains moites ou je ressens une raideur dans les mains et/ou les bras.

# str_ResultHistoryPage_BtnCancel
source: Cancel
es: Cancelar
fr: Annuler

# str_ResultHistoryPage_BtnCheck
source: Consult
es: Consultar
fr: Consulter

# str_ResultHistoryPage_BtnCheck_Msg
source: You haven't completed any tests yet.
es: Aún no has completado ningún test.
fr: Vous n'avez pas encore effectué de tests.

# str_ResultHistoryPage_BtnCheck_NoResults
source: No results found
es: No hay resultados
fr: Pas de résultats

# str_ResultHistoryPage_BtnCheck_OK
source: OK
es: Aceptar
fr: D'accord

# str_ResultHistoryPage_BtnClearHistory
source: Clear history
es: Borrar historial
fr: Effacer l'historique

# str_ResultHistoryPage_BtnClearHistory_Msg
source: Are you sure you want to clear all your history?
es: ¿Seguro que quieres borrar todo tu historial?
fr: Êtes-vous sûr de vouloir effacer tout votre historique ?

# str_ResultHistoryPage_BtnClearHistory_Question
source: Clear history?
es: ¿Borrar historial?
fr: Effacer l'historique ?

# str_ResultHistoryPage_BtnDelete
source: Delete
es: Eliminar
fr: Éliminer

# str_ResultHistoryPage_BtnDelete_Msg
source: Are you sure you want to delete this entry?
es: ¿Seguro que quieres eliminar este registro?
fr: Êtes-vous sûr de vouloir éliminer cette entrée ?

# str_ResultHistoryPage_BtnDelete_Question
source: Delete entry?
es: ¿Eliminar registro?
fr: Éliminer l'entrée ?

# str_ResultHistoryPage_BtnLastTest
source: Consult last test
es: Consultar último test
fr: Consulter le dernier test

# str_ResultHistoryPage_BtnSignUp_CmbGender
source: Select your gender
es: Selecciona tu género
fr: Sélectionnez votre genre

# str_ResultHistoryPage_BtnSignUp_EntAge
source: Age
es: Introduce tu edad
fr: Âge

# str_ResultHistoryPage_BtnSignUp_EntName
source: Name
es: Introduce tu nombre
fr: Nom

# str_ResultHistoryPage_ChooseOption_Question
source: What would you like to do with this entry?
es: ¿Qué quieres hacer con este resultado?
fr: Que voulez-vous faire de ce résultat ?

# str_ResultHistoryPage_ImgProfile_Error
source: Error
fr: Erreur

# str_ResultHistoryPage_ImgProfile_ErrorMsg
source: Error selecting picture: {0}
es: Error seleccionando foto: {0}
fr: Erreur de sélection de la photo : {0}

# str_ResultHistoryPage_ImgProfile_ErrorMsg2
source: A problem occurred while selecting the picture.
es: Ha ocurrido un problema al seleccionar la foto.
fr: Un problème est survenu lors de la sélection de la photo.

# str_ResultHistoryPage_ImgProfile_NoPermission
source: Permission to access storage denied
es: Permiso para acceder al almacenamiento denegado
fr: Permission d'accéder à la memoire refusée

# str_ResultHistoryPage_LblAge
source: X years old
es: X años
fr: X ans

# str_ResultHistoryPage_LblAge_Dyn
source: {0} years old
es: {0} años
fr: {0} ans

# str_ResultHistoryPage_LblGender
source: Gender
es: Género
fr: Genre

# str_ResultHistoryPage_LblHistory
source: Test history
es: Historial de tests
fr: Historique de tests

# str_ResultHistoryPage_LblNoResults
source: No results have been found.
es: No se han encontrado registros.
fr: Aucune entrée n'a été trouvée.

# str_ResultHistoryPage_LblUsername
source: Username
es: Nombre de usuario
fr: Nom d'utilisateur

# str_Genders_NB
source: Non-binary
es: No binario
fr: Non binaire

# str_LoginPage_BtnLogin_cmbGenderError
source: Please select a gender.
es: Por favor, selecciona un género.
fr: Veuillez sélectionner un genre.

# str_LoginPage_BtnConfirm
source: Confirm
es: Confirmar
fr: Confirmer

# str_LoginPage_LblSelectUser
source: Select a user:
es: Selecciona un usuario:
fr: Sélectionnez un utilisateur :

# str_LoginPage_BtnLogIn_NoUsers
source: No users found
es: No hay usuarios
fr: Pas d'utilisateurs

# str_LoginPage_BtnLogIn_WarningMsg
source: There is no user saved in the application. Please create a user and enter your details to continue.
es: No existe ningún usuario guardado en la aplicación. Por favor, crea un usuario e introduce tus datos para continuar.
fr: Il n'y a pas d'utilisateur enregistré dans l'application. Veuillez créer un utilisateur et saisir vos coordonnées pour continuer.

# str_App_NoConnection
source: No Internet connection
es: No hay conexión a Internet
fr: Pas de connexion Internet

# str_App_ConnectionBack
source: Internet connection reestablished
es: Conexión a Internet recuperada
fr: Connexion Internet rétablie

# str_App_DataSynced
source: Data synchronised with Firebase
es: Datos sincronizados con Firebase
fr: Données synchronisées avec Firebase

# str_Shell_MainMenuTab
source: Main menu
es: Menú principal
fr: Menu principal

# str_Shell_MyProfileTab
source: My Profile
es: Mi perfil
fr: Mon profil

# str_Shell_TbiLogOut
source: Log out
es: Cerrar sesión
fr: Se déconnecter

# str_Shell_TbiModifyProfile
source: Modify profile
es: Modificar perfil
fr: Modifier profil

# str_Shell_TbiDeleteProfile
source: Delete profile
es: Eliminar perfil
fr: Éliminer profil

# str_Shell_AboutPage_Title
source: About
es: Acerca de
fr: À propos

# str_Shell_AboutPage_LblIntro
source: MejorAppT is an app geared towards students' mental health and emotional wellbeing. It aims to provide an accessible and safe tool for students to track their mental health, manage academic stress and access useful self-care and wellbeing resources. This app is in no way intended to replace any form of therapy or traditional medicine. If you are experiencing severe symptoms, please seek professional advice first. Click on any of the following categories to get more information.
es: MejorAppT es una aplicación orientada a la salud mental y el bienestar emocional de los estudiantes. Su objetivo es proporcionar una herramienta accesible y segura para que los alumnos puedan realizar un seguimiento de su salud mental, gestionar el estrés académico y acceder a recursos útiles de autocuidado y bienestar. Con esta aplicación no se pretende bajo ningún concepto sustituir a ningún tipo de terapia o medicina tradicional. Si padeces síntomas graves, acude a un profesional antes de nada. Pulsa cualquiera de las siguientes categorías para obtener más información.
fr: MejorAppT est une application destinée à la santé mentale et au bien-être émotionnel des étudiants. Elle vise à fournir aux étudiants un outil accessible et sûr pour suivre l'évolution de leur santé mentale, gérer le stress universitaire et accéder à des ressources utiles en matière de soins personnels et de bien-être. Cette application n'est en aucun cas destinée à remplacer une quelconque forme de thérapie ou de médecine traditionnelle. Si vous souffrez de symptômes graves, veuillez d'abord consulter un professionnel. Cliquez sur l'une des catégories ci-dessous pour plus d'informations.

# str_Shell_AboutPage_ScientificBase
source: Academic and scientific basis
es: Base académico-científica
fr: Base académique et scientifique

# str_Shell_AboutPage_ScientificBase_Msg
source: All the tests herein presented are adapted as closely as possible from the following studies: • "Propiedades psicométricas de un cuestionario para la evaluación de la ansiedad ante los exámenes en adolescentes": Rosa Torrano-Martínez, Juan Manuel Ortigosa-Quiles, Antonio Riquelme-Marín and José Antonio López-Pina (University of Murcia). • "Comprendiendo el papel de la práctica física y el género en los trastornos alimentarios en estudiantes adolescentes españoles": Gema Sanchis-Soler, Irene León-Calero, Sergio Sebastia-Amat, María Antonia Parra-Rizo, Miguel García-Jaén (University of Alicante, International University of Valencia, Miguel Hernández University of Elche).
es: Todos los tests que en esta aplicación se presentan son una adaptación lo más fidedigna posible de los siguientes estudios: • «Propiedades psicométricas de un cuestionario para la evaluación de la ansiedad ante los exámenes en adolescentes»: Rosa Torrano-Martínez, Juan Manuel Ortigosa-Quiles, Antonio Riquelme-Marín y José Antonio López-Pina (Universidad de Murcia) • «Comprendiendo el papel de la práctica física y el género en los trastornos alimentarios en estudiantes adolescentes españoles»: Gema Sanchis-Soler, Irene León-Calero, Sergio Sebastia-Amat, María Antonia Parra-Rizo, Miguel García-Jaén (Universidad de Alicante, Universidad Internacional de Valencia, Universidad Miguel Hernández de Elche)
fr: Tous les tests présentés dans cette application sont adaptés au plus près des études suivantes : • « Propiedades psicométricas de un cuestionario para la evaluación de la ansiedad ante los exámenes en adolescentes » : Rosa Torrano-Martínez, Juan Manuel Ortigosa-Quiles, Antonio Riquelme-Marín et José Antonio López-Pina (Université de Murcie). • « Comprendiendo el papel de la práctica física y el género en los trastornos alimentarios en estudiantes adolescentes españoles » : Gema Sanchis-Soler, Irene León-Calero, Sergio Sebastia-Amat, María Antonia Parra-Rizo, Miguel García-Jaén (Université d'Alicante, Université internationale de Valence, Université Miguel Hernández d'Elche).

# str_Shell_AboutPage_Credits
source: Credits
es: Créditos
fr: Crédits

# str_Shell_AboutPage_Credits_Msg
source: This app has been developed by the IT department of IES Gregorio Prieto. Namely, the development team is formed by the following members: Esther Cantón, Francisco Carrero, Alberto Navarro and Manuel Valdepeñas.
es: Esta aplicación ha sido desarrollada por el departamento de Informática del IES Gregorio Prieto. Concretamente, el equipo de desarrollo lo han conformado los siguientes miembros: Esther Cantón, Francisco Carrero, Alberto Navarro y Manuel Valdepeñas.
fr: Cette application a été développée par le département d'informatique de l'IES Gregorio Prieto. Plus précisément, l'équipe de développement était composée des membres suivants : Esther Cantón, Francisco Carrero, Alberto Navarro et Manuel Valdepeñas.

# str_Shell_BtnClose
source: Close
es: Cerrar
fr: Fermer

# str_Shell_HelpPage_Title
source: Help
es: Ayuda
fr: Aide

# str_Shell_HelpPage_MainHeader
source: Welcome to MejorAppT! Here you can consult the most essential help to learn how to use and navigate the app. Click on any of the following categories to get more information.
es: ¡Te damos la bienvenida a MejorAppT! Aquí podrás consultar la ayuda más esencial para aprender a usar y navegar por la app. Pulsa cualquiera de las siguientes categorías para obtener más información.
fr: Nous vous souhaitons la bienvenue sur MejorAppT ! Vous trouverez ici l'aide la plus essentielle pour apprendre à utiliser et à naviguer dans l'application. Cliquez sur l'une des catégories ci-dessous pour obtenir plus d'informations.

# str_Shell_HelpPage_TopBar
source: Navigation bar
es: Barra de navegación
fr: Barre de navigation

# str_Shell_HelpPage_TopBar_Msg
source: In the top navigation bar, you can change between the two main tabs that make up the app: the main menu and your profile. Below you'll find more details about each of these tabs. • By clicking on (i), you can see information about this project, the involved developers and the studies that endorse this app. • By clicking on (?), you can access the app's help, as you will have already been able to see for yourself. • Finally, by clicking on the kebab menu (the three little dots in the top right corner), you will see a menu with options that allow you to log out, modify the current user or delete the user and all stored data.
es: En la barra superior de navegación, podrás cambiar entre las dos pestañas principales que componen la aplicación: el menú principal y el perfil. Más abajo se entrará en detalle en cada una de estas pestañas. • Haciendo clic en (i), podrás ver información acerca de este proyecto, los desarrolladores implicados y los estudios que avalan esta aplicación. • Haciendo clic en (?), accederás a la ayuda de la aplicación, como ya habrás podido comprobar por tu cuenta. • Por último, si haces clic en el menú de kebab (los tres puntitos en la esquina superior derecha), se desplegará un menú con opciones que te permitirán cerrar sesión, modificar el usuario actual o eliminar el usuario y todos sus datos almacenados.
fr: Dans la barre de navigation supérieure, vous pouvez basculer entre les deux onglets principaux qui composent l'application : le menu principal et le profil. Chacun de ces onglets sera expliqué plus en détail ci-dessous. • En cliquant sur (i), vous pourrez voir des informations sur ce projet, les développeurs impliqués et les études qui soutiennent cette application. • En cliquant sur (?), vous accéderez à l'aide de l'application, comme vous l'avez peut-être déjà constaté par vous-même. • Enfin, en cliquant sur l'icône de l'engrenage, un menu s'ouvrira avec des options qui vous permettront de vous déconnecter, de modifier l'utilisateur actuel, de supprimer l'utilisateur et toutes les données stockées, d'effacer l'historique de vos tests ou même de changer la langue de l'application.

# str_Shell_HelpPage_MainMenu
source: Main menu and tests
es: Menú principal y tests
fr: Menu principal et tests

# str_Shell_HelpPage_MainMenu_Msg
source: From the main menu, you'll be able to take one of three tests: • Quick anxiety test: consists of 20 questions and can be completed in approximately 2 minutes. • Complete anxiety test: consists of 48 questions and can be completed in approximately 6 minutes. • Eating disorders test: consists of 26 questions and can be completed in approximately 3 minutes. In each test, each question will be presented individually. Each question consists of 5 possible answers, and you must select one to advance to the next question. Your progress will be saved automatically, so that if, due to your own decision or external factors, the application closes, you have the option to resume your progress at another time. Once you have answered all the questions, the final result will be calculated and advices will be displayed on screen according to your answers. Your test will be saved in the system so that you can consult these same advices from your profile.
es: Desde el menú principal, podrás realizar uno de los tres tests que se ofertan: • Test rápido de ansiedad: consta de 20 preguntas y se puede realizar en aproximadamente 2 minutos. • Test completo de ansiedad: consta de 48 preguntas y se puede realizar en aproximadamente 6 minutos. • Test de trastornos de la conducta alimentaria: consta de 26 preguntas y se puede realizar en aproximadamente 3 minutos. En cada test, se presentará cada pregunta individualmente. Cada pregunta consta de 5 posibles respuestas, y debes seleccionar una para poder avanzar a la siguiente pregunta. Tu progreso se irá guardando automáticamente, para que si, por decisión propia o factores externos, se cierra la aplicación, tengas la opción de retomar tu progreso en otro momento. Una vez hayas respondido a todas las preguntas, se calculará el resultado final y se mostrarán en pantalla unos consejos acordes a tus respuestas. Tu test quedará guardado en el sistema para poder consultar estos mismos consejos desde tu perfil.
fr: À partir du menu principal, vous pouvez passer l'un des trois tests proposés : • Test d'anxiété rapide : comprend 20 questions et peut être complété en 2 minutes environ. • Test d'anxiété complet : comprend 48 questions et peut être complété en 6 minutes environ. • Test sur les troubles alimentaires : comprend 26 questions et peut être complété en 3 minutes environ. Dans chaque test, chaque question est présentée individuellement. Chaque question comporte 5 réponses possibles, et vous devez en sélectionner une pour passer à la question suivante. Votre progression sera sauvegardée automatiquement, de sorte que si, par choix ou par des facteurs externes, l'application se ferme, vous aurez la possibilité de reprendre votre progression à un autre moment. Une fois que vous avez répondu à toutes les questions, le résultat final est calculé et des conseils s'affichent à l'écran en fonction de vos réponses. Votre test sera sauvegardé dans le système afin que vous puissiez consulter ces mêmes conseils à partir de votre profil.

# str_Shell_HelpPage_MyProfile_Msg
source: In the "My profile" tab, you can see the details of the profile currently logged in to the application (name, age and gender). Remember that you can change these details or even create a new user from the menu in the top right corner. You can also change your profile picture by clicking on the picture itself. Just below, you will see a list of the tests you have completed with this user in chronological order, with the most recent one first. If you click on any of them, the tips associated with your answers in that test will be displayed. Finally, you can quickly and directly consult the tips of the last test you took by clicking on the ‘Consult last test’ button or delete all your history and start from scratch by clicking on the "Delete history" button.
es: En la pestaña «Mi perfil», podrás ver los datos del perfil que ha iniciado sesión actualmente en la aplicación (nombre, edad y género). Recuerda que puedes cambiar estos datos o incluso crear un nuevo usuario desde el menú de la esquina superior derecha. También puedes cambiar tu foto de perfil haciendo clic en la propia imagen. Justo debajo, aparecerá un listado de los tests que has completado con este usuario ordenados cronológicamente, estando primero el más reciente. Si pulsas en cualquiera de ellos, se mostrarán los consejos asociados a tus respuestas en dicho test. Por último, puedes consultar de forma rápida y directa los consejos del último test realizado en el botón «Consultar último test» o borrar todo tu historial y empezar de cero en el botón «Borrar historial».
fr: Dans l'onglet « Mon profil », vous pouvez voir les détails du profil actuellement connecté à l'application (photo, nom, âge et sexe). N'oubliez pas que vous pouvez modifier ces détails ou même créer un nouvel utilisateur à partir du menu situé dans le coin supérieur droit. Juste en dessous, vous verrez deux onglets : « Historique des tests » et « Analyse des résultats » : • Dans le premier onglet, vous verrez une liste des tests que vous avez effectués avec cet utilisateur dans l'ordre chronologique, le plus récent en premier. Si vous cliquez sur l'un d'entre eux, les conseils associés à vos réponses dans ce test s'affichent. Vous pouvez consulter rapidement et directement les conseils du dernier test que vous avez effectué en cliquant sur le bouton « Consulter le dernier test ». • Dans le deuxième onglet, vous verrez un graphique linéaire montrant votre évolution réelle en fonction des tests que vous avez effectués. Sélectionnez un type dans le menu déroulant et cliquez sur le bouton « Créer graphique » pour consulter vos données. Les informations relatives à chaque test que vous avez effectué sont affichées par ordre chronologique et, en haut, vous trouverez une évaluation globale de votre état. L'application dispose également de modèles d'intelligence artificielle qui vous aideront à comprendre où vous vous situez par rapport au grand public et à savoir si vous êtes sur la bonne voie ou non en fonction de vos tendances.

# str_Shell_ModifyPage_Apply
source: Apply
es: Aplicar
fr: Appliquer

# str_Shell_DeleteProfile_Question
source: Delete profile?
es: ¿Eliminar perfil?
fr: Éliminer le profil ?
