Repository: manuelvdlt99/MejorAppT
Catalog: MejorAppTG1/Resources/Localization/Strings.*.resx
Languages: es, fr

# str_Shell_DeleteProfile_Msg
source: Are you sure you want to delete your profile? Warning, all your data will be deleted! You will not be able to undo this action!
es: ¿Seguro que quieres eliminar tu perfil? ¡Atención, se borrarán todos tus datos! ¡No podrás deshacer esta acción!
fr: Êtes-vous sûr de vouloir éliminer votre profil ? Attention, toutes vos données seront supprimées ! Vous ne pourrez pas annuler cette action !

# str_QuickTest_Question2
source: I think the teacher is constantly looking at me.
es: Pienso que el profesor/a me está observando constantemente.
fr: Je pense que le professeur me surveille constamment.

# str_QuickTest_Question3
source: As I start to read the exam, my eyesight blurs and I don't understand what I am reading.
es: Al comenzar a leer el examen se me nubla la vista y no entiendo lo que leo.
fr: Lorsque je commence à lire l'examen, ma vue se brouille et je ne comprends pas ce que je lis.

# str_QuickTest_Question4
source: While I am taking an exam, I think I am doing very badly.
es: Mientras que estoy realizando el examen, pienso que lo estoy haciendo muy mal.
fr: Pendant que je passe l'examen, je pense que je me débrouille très mal.

# str_QuickTest_Question5
source: If I'm 5 minutes late for an exam I don't go in, I hide around the school or try to leave.
es: Si llego 5 minutos tarde a un examen ya no entro, me escondo por el instituto o intento marcharme.
fr: Si j'ai 5 minutes de retard pour un examen, je ne rentre pas, je me cache dans l'école ou j'essaie de partir.

# str_QuickTest_Question6
source: When a group of classmates talks about the exam before the teacher arrives, I get nervous.
es: Cuando un grupo de compañeros habla del examen antes de que venga el profesor me pongo nervioso/a.
fr: Lorsqu'un groupe de camarades de classe parle de l'examen avant l'arrivée du professeur, je deviens nerveux.

# str_QuickTest_Question7
source: For me it is a relief or reassurance when, for whatever reason, an exam is postponed.
es: Para mí supone una tranquilidad o alivio cuando, por cualquier razón, se aplaza un examen.
fr: Pour moi, c'est un soulagement ou un réconfort lorsque, pour une raison ou une autre, un examen est reporté.

# str_QuickTest_Question8
source: I can't get any sleep the night before an exam.
es: No consigo dormir la noche anterior a un examen.
fr: Je ne peux pas dormir la veille de l'examen.

# str_QuickTest_Question9
source: I think I won't be able to pass the exam, even if I have studied.
es: Pienso que no voy a poder aprobar el examen, aunque haya estudiado.
fr: Je ne pense pas pouvoir réussir l'examen, même si j'ai étudié.

# str_QuickTest_Question10
source: At the start of the exam, as soon as I read the questions, I hand it in blank to the teacher and return to my seat.
es: Al comenzar el examen, nada más leer las preguntas, lo entrego en blanco al profesor y vuelvo a mi sitio.
fr: Au début de l'examen, dès que j'ai lu les questions, je le remets vierge au professeur et je retourne à ma place.

# str_QuickTest_Question11
source: When I'm taking an exam, my heart beats very fast.
es: Cuando estoy haciendo un examen el corazón me late muy deprisa.
fr: Lorsque je fais un examen, mon cœur bat très vite.

# str_QuickTest_Question12
source: After taking an exam I feel I have done badly and think about disappearing or hurting myself.
es: Tras haber realizado un examen siento que lo he hecho fatal y pienso en desaparecer o hacerme daño.
fr: Après avoir passé un examen, j'ai l'impression d'avoir mal travaillé et je pense à disparaître ou à me faire du mal.

# str_QuickTest_Question13
source: It is hard or impossible for me to eat food before taking an exam.
es: Me resulta difícil o imposible ingerir alimentos antes de realizar un examen.
fr: Il m'est difficile, voire impossible, de manger avant un examen.

# str_QuickTest_Question14
source: I get sick and make excuses for not taking an exam.
es: Me pongo malo/a y doy excusas para no hacer un examen.
fr: Je tombe malade et je trouve des excuses pour ne pas passer un examen.

# str_QuickTest_Question15
source: In the hours/moments before the exam I feel sick to my stomach or my stomach gets upset and I have to go to the toilet.
es: En las horas/momentos previos al examen siento molestias en el estómago o se me descompone y tengo que ir al baño.
fr: Dans les heures/moments qui précèdent l'examen, j'ai des nausées ou des maux d'estomac qui m'obligent à aller aux toilettes.

# str_QuickTest_Question16
source: It takes me a long time to make up my mind when answering most of the questions or handing in the exam.
es: Tardo mucho tiempo en decidirme al contestar la mayoría de las preguntas o en entregar el examen.
fr: Il me faut beaucoup de temps pour me décider à répondre à la plupart des questions ou à rendre l'examen.

# str_QuickTest_Question17
source: Before entering the exam I speak very quickly and move around more than usual.
es: Antes de entrar al examen hablo con mucha rapidez y me muevo más de lo habitual.
fr: Avant de passer l'examen, je parle très vite et je bouge plus que d'habitude.

# str_QuickTest_Question18
source: During exams, I find it hard to concentrate and I sometimes get blocked.
es: Durante los exámenes me cuesta concentrarme y a veces me bloqueo.
fr: Pendant les examens, j'ai du mal à me concentrer et il m'arrive d'être bloqué.

# str_QuickTest_Question19
source: I establish a pre-exam ritual and if I can't do it, I find an excuse and don't enter the exam.
es: Establezco un ritual previo al examen y si no puedo cumplirlo, busco alguna excusa y no entro al examen.
fr: J'établis un rituel avant l'examen et si je n'y parviens pas, je cherche une excuse et ne me présente pas à l'examen.

# str_QuickTest_Question20
source: I can't sit still while taking an exam, I usually bite my nails or my pen.
es: Mientras hago un examen no puedo quedarme quieto, suelo morderme las uñas o el bolígrafo.
fr: Lors d'un examen, je ne peux pas rester assis, je me ronge souvent les ongles ou le stylo.

# str_FullTest_Question1
source: My hands sweat during exams.
es: En los exámenes me sudan las manos.
fr: Mes paumes deviennent moites pendant les examens.

# str_FullTest_Question2
source: When I have been doing the exam for a while, I feel discomfort in my stomach and the need to defecate.
es: Cuando llevo rato haciendo el examen, siento molestias en el estómago y necesidad de defecar.
fr: Lorsque je fais le test depuis un certain temps, je ressens une gêne au niveau de l'estomac et l'envie de déféquer.

# str_FullTest_Question3
source: As I start to read the exam, my eyesight blurs and I don't understand what I am reading.
es: Al comenzar a leer el examen se me nubla la vista y no entiendo lo que leo.
fr: Lorsque je commence à lire l'examen, ma vue se brouille et je ne comprends pas ce que je lis.

# str_FullTest_Question4
source: If I'm 5 minutes late for an exam I don't go in, I hide around the school or try to leave.
es: Si llego 5 minutos tarde a un examen ya no entro, me escondo por el instituto o intento marcharme.
fr: Si j'ai 5 minutes de retard pour un examen, je ne rentre pas, je me cache dans l'école ou j'essaie de partir.

# str_FullTest_Question5
source: The conditions in which an exam takes place (too much noise, heat, cold, sun...) influence me by increasing my nervousness.
es: Las condiciones donde se realiza un examen (mucho ruido, calor, frío, sol...) me influyen aumentando mi nerviosismo.
fr: Les conditions dans lesquelles se déroule un examen (trop de bruit, chaleur, froid, soleil...) m'influencent en augmentant ma nervosité.

# str_FullTest_Question6
source: When I finish an exam, my head hurts.
es: Cuando termino un examen me duele la cabeza.
fr: Lorsque je termine un examen, j'ai mal à la tête.

# str_FullTest_Question7
source: When I've been doing an exam for a while, I feel short of breath, very hot and like I'm going to faint.
es: Cuando llevo un rato haciendo el examen, yo siento que me falta el aire, mucho calor y sensación de que me voy a desmayar.
fr: Lorsque je fais l'examen depuis un certain temps, je me sens essoufflée, j'ai très chaud et j'ai l'impression que je vais m'évanouir.

# str_FullTest_Question8
source: I get nervous when the teacher stops just beside me and I can't continue answering.
es: Me siento nervioso/a si el profesor/a se para junto a mí y ya no puedo seguir contestando.
fr: Je me sens nerveux si le professeur se tient à côté de moi et que je ne peux plus répondre.

# str_FullTest_Question9
source: I get nervous when I see the teacher with the exams before entering the classroom.
es: Me pongo nervioso/a al ver al profesor/a con los exámenes antes de entrar al aula.
fr: Je suis nerveux lorsque je vois le professeur avec les copies d'examen avant d'entrer dans la salle de classe.

# str_FullTest_Question10
source: My hands and/or arms feel rigid during the exam.
es: En el examen siento rígidas las manos y/o los brazos.
fr: Pendant l'examen, mes mains et/ou mes bras sont raides.

# str_FullTest_Question11
source: Before entering the exam I feel a knot in my stomach, which disappears when I start writing.
es: Antes de entrar al examen siento un nudo en el estómago, que desaparece al comenzar a escribir.
fr: Avant de commencer l'examen, je ressens un nœud à l'estomac, qui disparaît lorsque je commence à écrire.

# str_FullTest_Question12
source: At the start of the exam, I hand it in blank to the teacher as soon as I read the questions and return to my seat.
es: Al comenzar el examen, nada más leer las preguntas lo entrego al profesor/a en blanco y vuelvo a mi sitio.
fr: Au début de l'examen, je le remets vierge à le professeur dès que j'ai lu les questions et que j'ai regagné ma place.

# str_FullTest_Question13
source: After the exam I cry easily, thinking how badly I have done even though I don't know the result.
es: Después del examen lloro con facilidad, al pensar lo mal que lo he hecho aunque no sepa el resultado.
fr: Après l'examen, je pleure facilement en pensant à mon échec, même si je ne connais pas le résultat.

# str_FullTest_Question14
source: While I'm doing the exam, I think I'm doing really badly.
es: Mientras que estoy realizando el examen, pienso que lo estoy haciendo muy mal.
fr: Pendant que je passe l'examen, je pense que je me débrouille très mal.

# str_FullTest_Question15
source: I get nervous when the others begin to hand in the exam before me.
es: Me siento nervioso/a si los demás comienzan a entregar el examen antes que yo.
fr: Je me sens nerveux si d'autres commencent à rendre l'examen avant moi.

# str_FullTest_Question16
source: I think the teacher is constantly looking at me.
es: Pienso que el profesor/a me está observando constantemente.
fr: Je pense que le professeur me surveille constamment.

# str_FullTest_Question17
source: I usually bite my nails or my pen during exams.
es: Suelo morderme las uñas o el bolígrafo durante los exámenes.
fr: Je me ronge souvent les ongles ou le stylo pendant les examens.

# str_FullTest_Question18
source: I feel a strong urge to go to the bathroom during the exam.
es: Tengo muchas ganas de ir al cuarto de baño durante el examen.
fr: J'ai vraiment envie d'aller aux toilettes pendant l'examen.

# str_FullTest_Question19
source: I can't sit still while doing the exam (I move my feet, I move my pen, I look around, I look at the time...).
es: No puedo quedarme quieto/a mientras hago el examen (muevo los pies, el bolígrafo, miro alrededor, miro la hora...).
fr: Je ne peux pas rester assis pendant l'examen (je bouge mes pieds, je bouge mon stylo, je regarde autour de moi, je regarde l'heure...).

# str_FullTest_Question20
source: I get sick and make excuses for not taking an exam.
es: Me pongo malo/a y doy excusas para no hacer un examen.
fr: Je tombe malade et je trouve des excuses pour ne pas passer un examen.

# str_FullTest_Question21
source: For me it is a relief or reassurance when, for some reason, an exam is postponed.
es: Para mí supone una tranquilidad o alivio cuando, por alguna razón, se aplaza un examen.
fr: Pour moi, c'est un soulagement ou un réconfort lorsque, pour une raison ou une autre, un examen est reporté.

# str_FullTest_Question22
source: I think I will not be able to pass the exam, even if I have studied.
es: Pienso que no voy a poder aprobar el examen, aunque haya estudiado.
fr: Je ne pense pas pouvoir réussir l'examen, même si j'ai étudié.

# str_FullTest_Question23
source: Before doing the exam I think that I can't remember anything and that I'm going to fail.
es: Antes de hacer el examen pienso que no me acuerdo de nada y voy a suspenderlo.
fr: Avant de passer l'examen, je pense que je ne me souviens de rien et que je vais échouer.

# str_FullTest_Question24
source: I can't get any sleep the night before an exam.
es: No consigo dormir la noche anterior a un examen.
fr: Je ne peux pas dormir la veille de l'examen.

# str_FullTest_Question25
source: I get nervous when the classroom is full of people.
es: Me pone nervioso/a que el aula esté llena de gente.
fr: Cela me rend nerveuse lorsque la salle de classe est pleine de monde.

# str_FullTest_Question26
source: I have felt dizzy and felt like vomiting during an exam.
es: He sentido mareos y ganas de vomitar en un examen.
fr: J'ai eu des vertiges et j'ai eu envie de vomir lors d'un examen.

# str_FullTest_Question27
source: Moments before the exam, my mouth is dry and I find it hard to swallow.
es: Momentos antes de hacer el examen tengo la boca seca y me cuesta tragar.
fr: Quelques instants avant l'examen, ma bouche est sèche et j'ai du mal à avaler.

# str_FullTest_Question28
source: If I sit in the front rows to take the exam, my nervousness increases.
es: Si me siento en las primeras filas para hacer el examen, aumenta mi nerviosismo.
fr: Si je m'assois dans les premiers rangs pour passer l'examen, ma nervosité augmente.

# str_FullTest_Question29
source: If the exam has a fixed deadline, my nervousness increases and I do worse.
es: Si el examen tiene un tiempo fijo para realizarse, aumenta mi nerviosismo y lo hago peor.
fr: Si l'examen a lieu à heure fixe, ma nervosité augmente et mes résultats sont moins bons.

# str_FullTest_Question30
source: I get nervous in very big classrooms.
es: Me siento nervioso/a en aulas muy grandes.
fr: Je me sens nerveux dans les grandes salles de classe.

# str_FullTest_Question31
source: When I'm taking an exam, my heart beats very fast.
es: Cuando estoy haciendo un examen el corazón me late muy deprisa.
fr: Lorsque je fais un examen, mon cœur bat très vite.

# str_FullTest_Question32
source: As I enter the room where the exam is taking place, my legs shake.
es: Al entrar en el aula donde se hace el examen me tiemblan las piernas.
fr: En entrant dans la salle d'examen, mes jambes tremblent.

# str_FullTest_Question33
source: I get nervous in rooms that are too small.
es: Me siento nervioso/a en las clases demasiado pequeñas.
fr: Je me sens nerveux dans les salles de classe trop petites.

# str_FullTest_Question34
source: When a group of classmates talks about the exam before the teacher arrives, I get more nervous.
es: Cuando un grupo de compañeros habla del examen antes de que venga el profesor me pongo más nervioso/a.
fr: Lorsqu'un groupe de camarades de classe parle de l'examen avant l'arrivée du professeur, je deviens plus nerveux.

# str_FullTest_Question35
source: When I exit the exam, I get the feeling I have done terribly.
es: Al salir del examen, tengo la sensación de haberlo hecho muy mal.
fr: En sortant de l'examen, j'ai le sentiment d'avoir fait très mal.

# str_FullTest_Question36
source: I think I will get nervous and I will forget everything.
es: Pienso que me voy a poner nervioso/a y se me va a olvidar todo.
fr: Je pense que je vais devenir nerveuse et tout oublier.

# str_FullTest_Question37
source: It takes me a long time to decide whether to answer most of the questions or to hand in the exam.
es: Tardo mucho tiempo en decidirme por contestar la mayoría de las preguntas o por entregar el examen.
fr: Il me faut beaucoup de temps pour décider de répondre à la plupart des questions ou de rendre l'examen.

# str_FullTest_Question38
source: I'd feel nervous if I had to take a personal interview exam.
es: Sentiría nerviosismo si tuviera que realizar un examen de entrevista personal.
fr: Je me sentirais nerveux si je devais passer un test d'entretien personnel.

# str_FullTest_Question39
source: I'd feel nervous if I had to take an oral exam in public.
es: Sentiría nerviosismo si tuviera que realizar un examen oral en público.
fr: Je me sentirais nerveux si je devais passer un examen oral en public.

# str_FullTest_Question40
source: I'd feel nervous if I had to present a project in class.
es: Sentiría nerviosismo si tuviera que realizar una exposición de un trabajo en clase.
fr: Je me sentirais nerveux si je devais présenter un exposé en classe.

# str_FullTest_Question41
source: I'd feel nervous if I had to take a written exam with alternative questions.
es: Sentiría nerviosismo si tuviera que realizar un examen escrito con preguntas alternativas.
fr: Je me sentirais nerveux si je devais passer un examen écrit avec des questions alternatives.

# str_FullTest_Question42
source: I'd feel nervous if I had to take a written exam with open questions.
es: Sentiría nerviosismo si tuviera que realizar un examen escrito con preguntas abiertas.
fr: Je me sentirais nerveux si je devais passer un examen écrit avec des questions ouvertes.

# str_FullTest_Question43
source: I'd feel nervous if I had to take a written exam to develop a whole topic.
es: Sentiría nerviosismo si tuviera que realizar un examen escrito de desarrollo de un tema completo.
fr: Je me sentirais nerveux si je devais passer un examen écrit pour développer un sujet entier.

# str_FullTest_Question44
source: I'd feel nervous if I had to take a written exam in front of a selection board.
es: Sentiría nerviosismo si tuviera que realizar un examen escrito tipo oposición ante un tribunal.
fr: Je me sentirais nerveux si je devais passer un examen écrit devant un jury.

# str_FullTest_Question45
source: I'd feel nervous if I had to take a general knowledge test.
es: Sentiría nerviosismo si tuviera que realizar un examen de cultura general.
fr: Je me sentirais nerveux si je devais passer un test de connaissances générales.

# str_FullTest_Question46
source: I'd feel nervous if I had to take an exam in calculus or maths problems.
es: Sentiría nerviosismo si tuviera que realizar un examen de cálculo o problemas matemáticos.
fr: Je me sentirais nerveux si je devais passer un examen de calcul ou de problèmes mathématiques.

# str_FullTest_Question47
source: I'd feel nervous if I had to take an exam with physical or gymnastic exercises.
es: Sentiría nerviosismo si tuviera que realizar un examen con pruebas físicas o gimnásticas.
fr: Je me sentirais nerveux si je devais passer un examen avec des épreuves physiques ou de gymnastique.

# str_FullTest_Question48
source: I'd feel nervous if I had to take a practical exam (typewriting, handling a computer, doing a project, drawing, etc.).
es: Sentiría nerviosismo si tuviera que realizar un examen práctico (escribir a máquina, manejar ordenador, realizar un proyecto, dibujo, etc.).
fr: Je me sentirais nerveux si je devais passer un examen pratique (dactylographie, ordinateur, projet, dessin, etc.).

# str_EatingTest_Question1
source: I am distressed at the thought of being too fat.
es: Me angustia la idea de estar demasiado gordo/a.
fr: Je suis angoissée à l'idée d'être trop grosse.

# str_EatingTest_Question2
source: I try not to eat when I'm hungry.
es: Procuro no comer cuando tengo hambre.
fr: J'essaie de ne pas manger quand j'ai faim.

# str_EatingTest_Question3
source: Food is a regular concern for me.
es: La comida es para mí una preocupación habitual.
fr: L'alimentation est une préoccupation régulière pour moi.

# str_EatingTest_Question4
source: I have suffered from binge eating crises where I felt like I couldn't stop eating.
es: He sufrido crisis de atracones en las que tenía la sensación de no poder parar de comer.
fr: J'ai souffert de crises de boulimie où j'avais l'impression de ne pas pouvoir m'arrêter de manger.

# str_EatingTest_Question5
source: I cut my food into small pieces.
es: Corto mis alimentos en pequeños trozos.
fr: Je coupe mes aliments en petits morceaux.

# str_EatingTest_Question6
source: I know the amount of calories of the food I eat.
es: Conozco la cantidad de calorías de los alimentos que como.
fr: Je connais le nombre de calories contenues dans les aliments que je mange.

# str_EatingTest_Question7
source: I try not to eat foods that contain a lot of carbohydrates (bread, rice, potatoes, etc.).
es: Procuro no comer alimentos que contengan muchos carbohidratos (pan, arroz, papas, etc.).
fr: J'essaie de ne pas manger d'aliments contenant beaucoup de glucides (pain, riz, pommes de terre, etc.).

# str_EatingTest_Question8
source: I get the impression that others would like to see me eat more.
es: Tengo la impresión de que a los demás les gustaría verme comer más.
fr: J'ai l'impression que les autres aimeraient me voir manger davantage.

# str_EatingTest_Question9
source: I vomit after eating.
es: Vomito después de comer.
fr: Je vomis après avoir mangé.

# str_EatingTest_Question10
source: I feel very guilty after eating.
es: Me siento muy culpable después de comer.
fr: Je me sens très coupable après avoir mangé.

# str_EatingTest_Question11
source: I am obsessed with the desire to be thinner.
es: Me obsesiona el deseo de estar más delgado/a.
fr: Je suis obsédée par le désir d'être plus mince.

# str_EatingTest_Question12
source: When I do sport I mainly think about burning calories.
es: Cuando hago deporte pienso sobre todo en quemar calorías.
fr: Lorsque je fais du sport, je pense surtout à brûler des calories.

# str_EatingTest_Question13
source: Other people think I'm too thin.
es: Los demás piensan que estoy demasiado delgado/a.
fr: Les autres pensent que je suis trop mince.

# str_EatingTest_Question14
source: The idea of having fat areas on my body and/or having cellulite worries me.
es: Me preocupa la idea de tener zonas gordas en el cuerpo y/o de tener celulitis.
fr: Je m'inquiète à l'idée d'avoir des zones de graisse sur mon corps et/ou de la cellulite.

# str_EatingTest_Question15
source: I take longer than others to eat.
es: Tardo más tiempo que los demás en comer.
fr: Je mets plus de temps que les autres à manger.

# str_EatingTest_Question16
source: I try not to eat food that contains sugar.
es: Procuro no comer alimentos que tengan azúcar.
fr: J'essaie de ne pas manger d'aliments contenant du sucre.

# str_EatingTest_Question17
source: I eat dietetic food.
es: Como alimentos dietéticos.
fr: Je mange des aliments diététiques.

# str_EatingTest_Question18
source: I get the impression that my life revolves around food.
es: Tengo la impresión de que mi vida gira alrededor de la comida.
fr: J'ai l'impression que ma vie tourne autour de la nourriture.

# str_EatingTest_Question19
source: I have good self-control when it comes to food.
es: Tengo un buen autocontrol en lo que se refiere a la comida.
fr: J'ai une bonne maîtrise de moi-même lorsqu'il s'agit de nourriture.

# str_EatingTest_Question20
source: I get the feeling that others are pressuring me to eat more.
es: Tengo la sensación de que los demás me presionan para que coma más.
fr: J'ai l'impression que les autres me poussent à manger plus.

# str_EatingTest_Question21
source: I spend too much time thinking about food.
es: Paso demasiado tiempo pensando en la comida.
fr: Je passe trop de temps à penser à la nourriture.

# str_EatingTest_Question22
source: I don't feel well after eating sweets.
es: No me siento bien después de haber tomado dulces.
fr: Je ne me sens pas bien après avoir mangé des sucreries.
