Repository: manuelvdlt99/MejorAppT
Catalog: MejorAppTG1/Resources/Localization/Strings.*.resx
Languages: es, fr

# str_ResultsPage_LblIntro_Low
source: Despite sometimes feeling more nervous than usual, your response to these situations is adequate and within the average. Keep it up. Moderate anxiety can help you stay focused on your studies, so long as it is not sustained over time, as it can get out of your control.
es: A pesar de que algunas veces te encuentres más nervioso/a de lo habitual, tu respuesta ante estas situaciones es adecuada y está dentro de la media. Sigue así. Una ansiedad moderada puede ayudarnos a mantenernos concentrados en el estudio, siempre que no se mantenga de manera sostenida en el tiempo, ya que puede dar lugar a quedar fuera de nuestro control.
fr: Bien que vous soyez parfois plus nerveux que d'habitude, votre réaction à ces situations est adéquate et dans la moyenne. Restez concentré. Une anxiété modérée peut vous aider à rester concentré sur vos études, à condition qu'elle ne se prolonge pas dans le temps, car elle peut devenir incontrôlable.

# str_ResultsPage_Category_Prevent
source: Things you can do before getting to this situation
es: Cosas que puedes hacer antes para no llegar a esta situación:
fr: Ce que vous pouvez faire pour éviter cette situation à l'avance

# str_ResultsPage_Category_SeeMore
source: Would you like to know more?
es: ¿Quieres ampliar?
fr: Souhaitez-vous en savoir plus ?

# str_ResultsPage_Category_BadSituation
source: If you are in over your head
es: Si la situación te sobrepasa:
fr: Si vous êtes dépassé par les événements

# str_ResultsPage_LblIntro_Low_2
source: Despite sometimes feeling more nervous than usual, your response to these situations is adequate and within the average. Keep it up. Moderate anxiety can help you stay focused on your studies, so long as it is not sustained over time, as it can get out of your control.
es: A pesar de que algunas veces te encuentres más nervioso/a de lo habitual, tu respuesta ante estas situaciones es adecuada y está dentro de la media. Sigue así. Una ansiedad moderada puede ayudarnos a mantenernos concentrados en el estudio, siempre que no se mantenga de manera sostenida en el tiempo, ya que puede dar lugar a quedar fuera de nuestro control.
fr: Bien que vous soyez parfois plus nerveux que d'habitude, votre réaction à ces situations est adéquate et dans la moyenne. Restez concentré. Une anxiété modérée peut vous aider à rester concentré sur vos études, à condition qu'elle ne se prolonge pas dans le temps, car elle peut devenir incontrôlable.

# str_ResultsPage_LblIntro_EatingTest
source: Thank you for completing the test. Below are recommendations based on your answers. These guidelines are a general guide to help you reflect on your relationship with food. Remember that this test is merely a guideline and does not replace a professional consultation. If you have any doubts or concerns, we recommend that you consult a specialist for a personalised assessment.
es: Gracias por completar el test. A continuación, te ofrecemos recomendaciones basadas en tus respuestas. Estas orientaciones son una guía general para ayudarte a reflexionar sobre tu relación con la alimentación. Recuerda que este test es meramente orientativo y no sustituye una consulta profesional. Si tienes dudas o inquietudes, te recomendamos acudir a un especialista para una evaluación personalizada.
fr: Nous vous remercions d'avoir répondu à ce test. Vous trouverez ci-dessous des recommandations basées sur vos réponses. Elles constituent un guide général pour vous aider à réfléchir à votre relation avec la nourriture. N'oubliez pas que ce test n'est qu'un guide et qu'il ne remplace pas une consultation professionnelle. Si vous avez des doutes ou des inquiétudes, nous vous recommandons de consulter un spécialiste pour une évaluation personnalisée.

# str_EatingAdvice1_Title
source: No clinical intervention required
es: No se requiere intervención clínica
fr: Aucune intervention clinique n'est nécessaire

# str_EatingAdvice1_Content
source: Congratulations! It appears you have a balanced relationship with food, keep it up. Even though you are not at risk, we believe it would be a good idea for you to stay alert in case your relationship with food changes.
es: ¡Enhorabuena! Parece que tienes una relación equilibrada con la comida, sigue así. Aunque no estás en riesgo, pensamos sería buena idea que te mantengas alerta por si la relación con la comida cambia.
fr: Félicitations ! Il semble que vous ayez une relation équilibrée avec la nourriture, alors continuez dans cette voie. Bien que vous ne soyez pas à risque, nous pensons qu'il serait bon de garder un œil sur les changements dans votre relation avec la nourriture.

# str_EatingAdvice2_Title
source: Urgent clinical assessment
es: Evaluación clínica urgente
fr: Évaluation clinique urgente

# str_EatingAdvice2_Content
source: Your relationship with food is not healthy. Please consult a medical specialist as soon as possible so that they can help you.
es: Tu relación con la comida no es saludable. Por favor, consulta con un especialista médico lo más rápido posible para que te pueda brindar su ayuda.
fr: Votre relation avec la nourriture n'est pas saine. Consultez au plus vite un médecin spécialiste afin qu'il puisse vous aider.

# str_EatingAdvice3_Title
source: Additional clinical assessment
es: Evaluación clínica adicional
fr: Évaluation clinique additionnelle

# str_EatingAdvice3_Content
source: Thank you very much for using this app. Please note that this is for guidance only, we recommend that you speak to a health professional or counsellor to address any concerns you may have regarding your eating habits. There are signs that you may be developing an eating disorder.
es: Muchas gracias por usar esta app. No olvides que esto es meramente orientativo, te recomendamos que hables con un profesional de la salud o un consejero para abordar cualquier preocupación que puedas tener sobre tus hábitos alimenticios. Hay indicios de que puedes desarrollar un trastorno de la alimentación.
fr: Merci d'avoir utilisé cette application. Nous vous recommandons de consulter un professionnel de la santé ou un conseiller pour répondre à vos préoccupations concernant vos habitudes alimentaires. Certains signes peuvent indiquer que vous êtes en train de développer un trouble de l'alimentation.

# str_EatingAdvice4_Title
source: Exploratory assessment and preventive monitoring
es: Evaluación exploratoria y seguimiento preventivo
fr: Évaluation exploratoire et suivi préventif

# str_EatingAdvice4_Content
source: We believe your relationship with food worries you based on your eating habits and the emotions they trigger in you. It would be very wise to talk about this issue with someone around you, with judgement and experience, whom you can trust.
es: Pensamos que la relación con la comida te preocupa en base a tus hábitos alimenticios y emociones que te provoca. Sería muy buena idea que hablaras de este tema con alguien de tu entorno, con criterio y experiencia, con el que tengas confianza.
fr: Nous pensons que votre rapport à la nourriture vous préoccupe en raison de vos habitudes alimentaires et des émotions qu'elle suscite en vous. Il serait bon que vous en parliez avec une personne de votre entourage, dotée de jugement et d'expérience, en qui vous avez confiance.

# str_ResultsPage_LinkError
source: Error opening the link: {0}
es: Error al abrir el enlace: {0}
fr: Erreur d'ouverture du lien : {0}

# str_ResultsPage_LinkError_Msg
source: The link can't be opened. Check that it is valid.
es: No se puede abrir el enlace. Verifica que sea válido.
fr: Le lien ne peut être ouvert. Vérifiez qu'il est valide.

# str_ResultHistoryPage_LblCurrentPage
source: Page 1/X
es: Página 1/X
fr: Pâge 1 / X

# str_ResultHistoryPage_LblCurrentPage_Dyn
source: Page {0}/{1}
es: Página {0}/{1}
fr: Pâge {0} / {1}

# str_ResultsPage_BtnFinish
source: Return
es: Volver
fr: Revenir

# str_AnxietyAdvice21_Title
source: Ho'oponopono technique
es: Técnica Ho'oponopono
fr: Technique Ho'oponopono

# str_AnxietyAdvice21_Content
source: This Hawaiian technique seeks to clean negative memories and emotions that may affect our lives. Recording in Spanish: https://www.youtube.com/embed/hV3A-BzfGZM?si=uQDjLgWi_8LJmmTV
es: Esta técnica hawaiana busca limpiar memorias y emociones negativas que puedan afectar a nuestras vidas. hooponopono.mp3
fr: Cette technique hawaïenne vise à éliminer les souvenirs et les émotions négatives qui peuvent affecter notre vie. Enregistrement en espagnol: https://www.youtube.com/embed/hV3A-BzfGZM?si=uQDjLgWi_8LJmmTV

# str_AnxietyAdvice22_Title
source: Meditation session
es: Sesión de meditación
fr: Séance de méditation

# str_AnxietyAdvice22_Content
source: Relax and connect with your inner self with this short guided meditation session. Find a quiet place, get comfortable and let the audio guide (in Spanish) you to inner calm. https://www.youtube.com/embed/C6bDxq1S7lw?si=eRZpZsPdmTRhGLxd
es: Relájate y conecta con tu interior con esta breve sesión de meditación guiada. Encuentra un lugar tranquilo, acomódate y deja que el audio te guíe hacia la calma interior. meditation.mp3
fr: Détendez-vous et entrez en contact avec vous-même grâce à cette courte séance de méditation guidée. Trouvez un endroit calme, installez-vous confortablement et laissez l'audio (en espagnol) vous guider vers le calme intérieur. https://www.youtube.com/embed/C6bDxq1S7lw?si=eRZpZsPdmTRhGLxd

# str_AnxietyAdvice23_Title
source: Ambient music
es: Música de ambiente
fr: Musique d'ambiance

# str_AnxietyAdvice23_Content
source: Ambient music created by our students. Recommended for any of the meditations of other advices. https://www.youtube.com/embed/R5Ji-rDCCh0?si=2w1zvhL1QPskLS87
es: Música de ambiente creada por nuestro alumnado. Aconsejada para cualquiera de las meditaciones de otros consejos. audiorelax.mp3
fr: Musique d'ambiance créée par nos étudiants. Recommandé pour toutes les méditations des autres conseils. https://www.youtube.com/embed/R5Ji-rDCCh0?si=2w1zvhL1QPskLS87

# str_ResultHistoryPage_Loading
source: Hold on, we're retrieving your data. It will only take a moment!
es: Espera, estamos recuperando tus datos. ¡Será solo un momento!
fr: Attendez, nous récupérons vos données. Cela ne prendra qu'un instant !

# str_ResultsPage_Loading
source: Just a moment, we are processing your results to offer you the best advice.
es: Un momento, estamos procesando tus resultados para ofrecerte los mejores consejos.
fr: Un instant, nous traitons vos résultats pour vous conseiller au mieux.

# str_SemanticProperties_LoginPage_Img
source: MejorAppT app icon
es: Icono de la aplicación MejorAppT
fr: Icône de l'application MejorAppT

# str_SemanticProperties_LoginPage_AppName
source: App name: MejorAppT
es: Nombre de la aplicación: MejorAppT
fr: Nôm de l'application : MejorAppT

# str_SemanticProperties_LoginPage_BtnLogIn_Desc
source: Button to log in with an existing user.
es: Botón para iniciar sesión con un usuario existente.
fr: Bouton pour se connecter avec un utilisateur existant.

# str_SemanticProperties_LoginPage_BtnLogIn_Hint
source: Click here to log in with an already created user.
es: Haz clic aquí para iniciar sesión con un usuario previamente registrado.
fr: Cliquez ici pour vous connecter avec un utilisateur déjà enregistré.

# str_SemanticProperties_LoginPage_BtnSignUp_Desc
source: Button to create a new user.
es: Botón para crear un nuevo usuario.
fr: Bouton pour créer un nouveau utilisateur.

# str_SemanticProperties_LoginPage_BtnSignUp_Hint
source: Click here to create a new user in the app.
es: Haz clic aquí para crear un nuevo usuario en la aplicación.
fr: Cliquez ici pour créer un nouvel utilisateur dans l'application.

# str_SemanticProperties_LoginPage_SignUpPopup_Name
source: Field to enter a name or nickname of the user to be created.
es: Campo para introducir un nombre o un nick del usuario a crear.
fr: Champ permettant de saisir le nom ou le surnom de l'utilisateur à créer.

# str_SemanticProperties_LoginPage_SignUpPopup_ErrorName
source: Error: a name is required.
es: Error: el nombre es obligatorio.
fr: Erreur : le nom est obligatoire.

# str_SemanticProperties_LoginPage_SignUpPopup_Age_Desc
source: Field to enter the age of the user to be created.
es: Campo para introducir la edad del usuario a crear.
fr: Champ permettant de saisir l'âge de l'utilisateur à créer.

# str_SemanticProperties_LoginPage_SignUpPopup_Age_Hint
source: The age must be between 12 and 99 years.
es: La edad debe estar comprendida entre los 12 y los 99 años.
fr: L'âge doit être compris entre 12 et 99 ans.

# str_SemanticProperties_LoginPage_SignUpPopup_ErrorAge1
source: Error: the age is invalid.
es: Error: la edad es incorrecta.
fr: Erreur : l'âge n'est pas correct.

# str_SemanticProperties_LoginPage_SignUpPopup_ErrorAge2
source: Error: the age must be within the permitted range of 12 to 99 years.
es: Error: la edad debe estar dentro del rango permitido de 12 a 99 años.
fr: Erreur : l'âge doit être compris dans la fourchette autorisée de 12 à 99 ans.

# str_SemanticProperties_LoginPage_SignUpPopup_GenderPicker_Desc
source: Picker to select the user's gender.
es: Selector para elegir el género del usuario.
fr: Sélecteur permettant de choisir le genre de l'utilisateur.

# str_SemanticProperties_LoginPage_SignUpPopup_GenderPicker_Hint
source: Select an option: male, female or non-binary.
es: Selecciona una opción: hombre, mujer o no binario.
fr: Sélectionnez une option : homme, femme ou non binaire.

# str_SemanticProperties_LoginPage_SignUpPopup_GenderError
source: Error: a gender must be selected.
es: Error: debes seleccionar una opción.
fr: Erreur : vous devez sélectionner une option.

# str_SemanticProperties_LoginPage_SignUpPopup_AllGood
source: Data successfully confirmed.
es: Datos confirmados correctamente.
fr: Données confirmées avec succès.

# str_SemanticProperties_LoginPage_BtnSignUp
source: Button to confirm the user's details.
es: Botón para confirmar los datos del usuario.
fr: Bouton pour confirmer les données de l'utilisateur.

# str_SemanticProperties_LoginPage_SignUpPopup_BtnCancel
source: Button to cancel the operation.
es: Botón para cancelar la operación.
fr: Bouton pour annuler l'opération.

# str_SemanticProperties_LoginPage_UsersPopup_Title
source: Select one of the users you have created.
es: Selecciona uno de los usuarios que hayas creado.
fr: Sélectionnez l'un des utilisateurs que vous avez créés.

# str_SemanticProperties_LoginPage_UsersPopup_Name
source: User name.
es: Nombre del usuario.
fr: Nom d'utilisateur.

# str_SemanticProperties_LoginPage_UsersPopup_Age
source: User age.
es: Edad del usuario.
fr: Âge d'utilisateur.

# str_SemanticProperties_LoginPage_UsersPopup_Gender
source: User gender.
es: Género del usuario.
fr: Genre d'utilisateur.

# str_SemanticProperties_LoginPage_UsersPopup_Image
source: User profile picture.
es: Foto de perfil del usuario.
fr: Image du profil d'utilisateur.

# str_SemanticProperties_LoginPage_UsersPopup_SelectedUser
source: User: {0}, of age: {1} and gender: {2}
es: Usuario: {0}, con edad: {1} y género: {2}
fr: Utilisateur : {0}, avec âge : {1} et genre : {2}

# str_SemanticProperties_LoginPage_UsersPopup_List
source: List of available users. Select one to continue.
es: Lista de usuarios disponibles. Selecciona uno para continuar.
fr: Liste des utilisateurs disponibles. Sélectionnez-en un pour continuer.

# str_SemanticProperties_LoginPage_UsersPopup_SelectedUser2
source: Selected user: {0}
es: Usuario seleccionado: {0}
fr: Utilisateur sélectionné : {0}

# str_SemanticProperties_LoginPage_UserCreated
source: User {0} successfully created.
es: Usuario {0} creado correctamente.
fr: L'utilisateur {0} a été créé avec succès.

# str_SemanticProperties_LoginPage_BtnLogIn_NoUsers
source: There are no users available.
es: No hay usuarios disponibles.
fr: Il n'y a pas d'utilisateurs disponibles.

# str_SemanticProperties_LoginPage_BtnLogIn_Success
source: User {0} selected.
es: Usuario {0} seleccionado. Iniciando sesión.
fr: Utilisateur {0} sélectionné.

# str_SemanticProperties_ResultHistoryPage_ImgProfile
source: This is the user's profile picture.
es: Esta es la imagen de perfil del usuario.
fr: Il s'agit de l'image de profil de l'utilisateur.

# str_SemanticProperties_ResultHistoryPage_ImgEditProfile
source: Icon to edit the user's profile picture.
es: Icono para editar la imagen de perfil del usuario.
fr: Icône permettant de modifier l'image de profil de l'utilisateur.

# str_SemanticProperties_ResultHistoryPage_BtnPrevious
source: Button to navigate to previous results.
es: Botón para navegar a los resultados anteriores.
fr: Bouton pour naviguer vers les résultats précédents.

# str_SemanticProperties_ResultHistoryPage_BtnNext
source: Button to navigate to next results.
es: Botón para navegar a los resultados siguientes.
fr: Bouton pour naviguer vers les résultats suivants.

# str_SemanticProperties_ResultsPage_LblIntro
source: Below you will find the advices we have prepared based on your answers to help you make the best possible approach to your health.
es: Más abajo podrás consultar los consejos que hemos elaborado en base a tus respuestas para poder abordar tu salud de la mejor manera posible.
fr: Vous trouverez ci-dessous les conseils que nous avons élaborés sur la base de vos réponses pour vous aider à adopter la meilleure approche possible en matière de santé.

# str_SemanticProperties_Shell_MainMenu
source: Main menu of the app.
es: Menú principal de la aplicación.
fr: Ménu principal de l'application.

# str_SemanticProperties_Shell_ProfileTab
source: Access your profile and previous results.
es: Accede a tu perfil y resultados anteriores.
fr: Accédez à votre profil et à vos résultats antérieurs.

# str_SemanticProperties_Shell_TbiLogOut_Desc
source: Log out of this user and return to the login page.
es: Cerrar sesión en este usuario y volver a la pantalla para iniciar sesion o registrarse.
fr: Déconnexion de cet utilisateur et retour à la pâge de connexion ou d'enregistrement.

# str_SemanticProperties_Shell_TbiLogOut_Help
source: Click here to log out.
es: Toca aquí para cerrar sesión.
fr: Cliquez ici pour vous déconnecter.

# str_SemanticProperties_Shell_TbiModify_Desc
source: Modify your personal data and your preferences.
es: Modificar tus datos personales y preferencias.
fr: Modifier vos données personnelles et vos préférences.

# str_SemanticProperties_Shell_TbiModify_Help
source: Click here to open the profile editing screen.
es: Toca aquí para abrir la ventana de modificación del perfil.
fr: Cliquez ici pour ouvrir la fenêtre de modification du profil.

# str_SemanticProperties_Shell_TbiDelete_Desc
source: Delete your profile and all associated information.
es: Eliminar tu perfil y toda la información asociada.
fr: Éliminer votre profil et toutes les informations qui y sont associées.

# str_SemanticProperties_Shell_TbiDelete_Help
source: Click here to delete your profile - be careful, this action is irreversible!
es: Toca aquí para eliminar tu perfil. ¡Ten cuidado, esta acción es irreversible!
fr: Cliquez ici pour éliminer votre profil - attention, cette action est irréversible !

# str_SemanticProperties_Shell_AboutPage_BtnClose
source: Button to close the About information popup.
es: Botón para cerrar el popup de información Acerca de.
fr: Bouton permettant de fermer la fenêtre contextuelle « À propos ».

# str_SemanticProperties_Shell_HelpPage_BtnClose
source: Button to close the Help popup.
es: Botón para cerrar el popup de ayuda.
fr: Bouton permettant de fermer la fenêtre contextuelle « Aide ».

# str_SemanticProperties_LoginPage_SignUpPopup_Name_Hint
source: Enter a name or nickname.
es: Introduce un nombre o nick.
fr: Saisissez un nom ou surnom.

# str_SemanticProperties_TestPage_QuestionCount
source: Question {0} out of {1}
es: Pregunta {0} sobre {1}
fr: Question {0} sur {1}

# str_SemanticProperties_MainPage_Welcome
source: You are in the app's main menu. Below you will find the three types of tests to take: quick anxiety test (estimated time: 2 minutes), complete anxiety test (estimated time: 6 minutes), eating disorders test (estimated time: 3 minutes).
es: Te encuentras en el menú principal de la aplicación. Más abajo encontrarás los tres tipos de tests a realizar: test rápido de ansiedad (duración estimada: 2 minutos), test completo de ansiedad (duración estimada: 6 minutos), test para trastornos de la conducta alimentaria (duración estimada: 3 minutos).
fr: Bienvenue dans le menu principal de l'application. Vous trouverez ci-dessous les trois types de tests à effectuer : test d'anxiété rapide (durée estimée : 2 minutes), test d'anxiété complet (durée estimée : 6 minutes), test pour les troubles de la conduite alimentaire (durée estimée : 3 minutes).

# str_UserSelectPopup_ChooseUserToast
source: Please select an user.
es: Por favor, selecciona un usuario.
fr: Veuillez sélectionner un utilisateur.

# str_SemanticProperties_LoginPage_BtnLogIn_BtnConfirm_Desc
source: Button to log in with the currently selected user.
fr: Bouton pour se connecter avec l'utilisateur sélectionné.

# str_SemanticProperties_LoginPage_BtnLogIn_BtnConfirm_Hint
source: Click here to access the main menu with the currently selected user.
fr: Cliquez ici pour accéder au menu principal avec l'utilisateur sélectionné.

# str_SemanticProperties_LoginPage_SignUpPopup_GenderMaleSelected
source: Gender selected: Male.
fr: Genre sélectionné : Homme.

# str_SemanticProperties_LoginPage_SignUpPopup_GenderFemaleSelected
source: Gender selected: Female.
fr: Genre sélectionné : Femme.

# str_SemanticProperties_LoginPage_SignUpPopup_GenderNBSelected
source: Gender selected: Non-binary.
fr: Genre sélectionné : Non-binaire.

# str_Shell_SettingsPage_Title
source: Settings
fr: Paramètres

# str_SettingsPage_BtnLanguage
source: Change language
fr: Changer de langue

# str_SettingsPage_LblLanguage
source: Language
fr: Langue

# str_LanguagePopup_LblTitle
source: Select a language
fr: Sélectionnez une langue

# str_SettingsPage_LblData
source: Data Management
fr: Gestion des données

# str_SemanticProperties_SettingsPage_BtnLanguage_Desc
source: Language selector.
fr: Sélecteur de langue.

# str_SemanticProperties_SettingsPage_BtnLanguage_Hint
source: Click here to change the app's display language.
fr: Cliquez ici pour changer la langue d'affichage de l'application.

# str_ResultsPage_Category_KeepItUp
source: Things you can do to keep controlling the situation
fr: Ce que vous pouvez faire pour continuer de controler la situation

# str_ResultsPage_Category_GeneralAdvice
source: General advices
fr: Conseils généraux

# str_AdvicesPage_Loading
source: Loading advices...
fr: Chargement des conseils...

# str_AdvicesPage_BtnYoutube
source: Watch on YouTube
fr: Regarder sur YouTube

# str_AdvicesPage_Alert_NoOpenVideo_Title
source: Error
fr: Erreur

# str_AdvicesPage_Alert_NoOpenVideo_Desc
source: An error has occurred while trying to open the video on YouTube.
fr: Une erreur s'est produite lors de l'ouverture de la vidéo sur YouTube.

# str_ResultHistoryPage_LblAnalysis
source: Result analysis
fr: Analyse des résultats

# str_SemanticProperties_ResultHistoryPage_PickTipos_Desc
source: Picker to select a test type.
fr: Sélecteur permettant de choisir un type de test.

# str_SemanticProperties_ResultHistoryPage_PickTipos_Hint
source: Select an option: Anxiety (quick), Anxiety (full), Eating disorders
fr: Sélectionnez une option : Anxiété (rapide), Anxiété (complet), Troubles des conduites alimentaires

# str_ResultHistoryPage_BtnCreateGraph
source: Create chart
fr: Créer graphique

# DateFormat
source: dd MMMM yyyy
es: dd 'de' MMMM 'de' yyyy

# str_MainPage_BtnEatingTest_Questions
source: 26 questions
es: 26 preguntas

# str_MainPage_BtnFullTest_Questions
source: 48 questions
es: 48 preguntas
